## Plan Result (Staging)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.staging-apps.azurerm_dns_a_record.this[&#34;libra-gateway&#34;]
  * module.staging-apps.azurerm_dns_cname_record.this[&#34;crimeportal&#34;]
  * module.staging-apps.azurerm_dns_zone.zone
  * module.staging-apps.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.staging-apps.azurerm_dns_a_record.this["libra-gateway"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "libra-gateway"
      + records             = [
          + "185.230.153.229",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps.azurerm_dns_cname_record.this["crimeportal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "crimeportal"
      + record              = "crimeportal.apps-nle.hmcts.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.apps.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"
    }

  # module.staging-apps.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1430,"Program":"tfcmt","SHA1":"","Target":"Staging","Vars":{}} -->